sdaiGetAllAttrs(Sdai_instS*,System.Int32*)
\details
Retrieves all attribute values from a specified application instance.
\param instance   [in] An application instance.
\param numberAttr [in] A placeholder for the number of required attributes.
\returns A raw pointer to the handle of the attribute data block that contains all attributes for the specified application instance.
\remarks
This function is not implemented yet.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiSY_ERR - Underlying system error.